import React, { Component } from 'react';
import { View, Image, StyleSheet, ScrollView } from 'react-native';
import { Container, Header, Content, Button, Text } from 'native-base';
import { Actions } from 'react-native-router-flux';
import { MyHeader } from '../common';

const knowledge01 = require('../../../assets/img/knowledge/knowledge01.jpg');
const knowledge02 = require('../../../assets/img/knowledge/knowledge02.jpg');
const knowledge03 = require('../../../assets/img/knowledge/knowledge03.jpg');

class Info extends Component {
    linkToHome() {
        Actions.home();
    }
    render() {
        return (
            <Container>
                <MyHeader title="ความรู้สุกร" />
                <ScrollView>
                    <Text style={[styles.titletext, styles.kanit]}>
                        การเลี้ยงสุกร
                </Text>
                    <View style={styles.center}>
                        <Image style={{ width: 250, height: 150 }}
                            source={knowledge01} />
                        <Text style={[styles.kanit, styles.textimage]}>
                            ฟาร์มสุกร
                    </Text>
                    </View>
                    <Text style={[styles.text, styles.kanit]}>
                        ในปัจจุบันการเลี้ยงสุกรได้พัฒนาขึ้นมากทั้งการเลี้ยงดู การให้อาหารและการปรับปรุงพันธุ์มีการสร้างโรงเรือนเลี้ยงสุกร อาหารสำหรับสุกรก็ได้รับการปรับปรุงให้มีคุณภาพสูงเป็นอาหารผสมที่มีประโยชน์มีสารอาหารครบ ๕ หมู่ ได้แก่ น้ำ คาร์โบไฮเดรต โปรตีน ไขมัน วิตามิน และแร่ธาตุ พันธุ์ของสุกรเปลี่ยนไปตามความต้องการของผู้เลี้ยงและผู้บริโภค ลักษณะของอาหารที่สุกรกิน และตามความประสงค์ของผู้ผสมพันธุ์
                </Text>
                    <Text style={[styles.titletext, styles.kanit]}>
                        ประเภทและพันธุ์สุกร
                </Text>
                    <View style={styles.center}>
                        <Image style={{ width: 250, height: 150 }}
                            source={knowledge03} />
                        <Text style={[styles.kanit, styles.textimage]}>
                            สุกร
                    </Text>
                    </View>
                    <Text style={[styles.text, styles.kanit]}>
                        หมูที่เลี้ยงในปัจจุบันมีอยู่หลายพันธุ์ รูปร่างลักษณะของหมูเกิดจากการผสมพันธุ์และการคัดเลือกพันธุ์ตามความต้องการของนักผสมพันธุ์และผู้บริโภคตลอดจนอาหารที่ใช้เลี้ยงดู ถ้าจัดแบ่งหมูตามรูปร่างลักษณะและคุณภาพของเนื้อแล้วจะแบ่งออกเป็น ๓ ประเภท คือ
                    {"\n"}{'\u00A0'}1. ประเภทมัน
                    {"\n"}{'\u00A0'}2. ประเภทเนื้อ
                    {"\n"}{'\u00A0'}3. ประเภทเบคอน
                </Text>
                    <Text style={[styles.titletext2, styles.kanit]}>
                        1. สุกรประเภทมัน
                </Text>
                    <Text style={[styles.text, styles.kanit]}>
                        สุกรประเภทนี้มีลักษณะอ้วนเตี้ย ลำตัวหนาแต่สั้น สะโพกเล็ก มีมันมาก มีเนื้อแดงน้อย สุกรประเภทมันมีขนาดเล็กเจริญเติบโตช้าและกินอาหารเปลือง  ตัวอย่างพันธุ์สุกรที่จัดไว้ในสุกรประเภทมัน ได้แก่ สุกรพันธุ์พื้นเมืองทั้งที่เป็นพันธุ์ดั้งเดิมของไทย เช่น พันธุ์ราด พันธุ์พวง ฯลฯ และที่มีถิ่นดั้งเดิมจากประเทศจีน คือ พันธุ์ไหหลำ
                </Text>
                    <Text style={[styles.titletext2, styles.kanit]}>
                        2. สุกรประเภทเนื้อ
                </Text>
                    <Text style={[styles.text, styles.kanit]}>
                        สุกรประเภทนี้มีคุณสมบัติอยู่กึ่งกลางระหว่างสุกรประเภทมันและเบคอน  ดังนั้นสุกรประเภทเนื้อลำตัวจึงยาวกว่าประเภทมันแต่ไม่ยาวมากนัก  มีส่วนไหล่และสะโพกใหญ่อวบ ลำตัวหนาและลึก หลังโค้งพองาม  ตัวอย่างสุกรประเภทนี้คือ สุกรพันธุ์ดูร็อก พันธุ์แฮมเชียร์ เป็นต้น
                </Text>
                    <Text style={[styles.titletext2, styles.kanit]}>
                        3. สุกรประเภทเบคอน
                </Text>
                    <Text style={[styles.text, styles.kanit]}>
                        สุกรประเภทนี้มีขนาดใหญ่ ผอม ลำตัวยาวกว่าประเภทอื่น ๆ แต่ค่อนข้างบาง กระดูกใหญ่ ขายาว สะโพกเล็ก เป็นสุกรที่เป็นหนุ่มเป็นสาวช้า สุกรประเภทเบคอนมีเนื้อสามชั้นเหมาะสำหรับทำสุกรเค็ม ตามกรรมวิธีของชาวต่างประเทศ เรียกว่า เบคอน ได้แก่ สุกรพันธุ์แลนด์เรซและพันธุ์ลาร์จไวต์ เป็นต้น
                </Text>
                    <Text style={[styles.titletext, styles.kanit]}>
                        อาหารของสุกร
                </Text>
                    <Text style={[styles.text, styles.kanit]}>
                        เนื่องจากการเลี้ยงหมูในปัจจุบันมีการเปลี่ยนแปลงให้ทันสมัยและเป็นการค้ามากขึ้น มีการนำเอาหมูพันธุ์ต่างประเทศเข้ามาเลี้ยงหรือผสมกับหมูพันธุ์พื้นเมืองกันอย่างกว้างขวาง หมูพันธุ์ต่างประเทศนี้มีความต้องการสารอาหารมากกว่าหมูพันธุ์พื้นเมืองของไทย อาหารที่ใช้เลี้ยงจึงต้องเปลี่ยนแปลงไปใช้อาหารผสมที่มีคุณค่าอาหารมากขึ้นเพื่อให้หมูได้รับสารอาหารเพียงพอกับความต้องการของร่างกายหมูจะได้เจริญเติบโตเร็วขึ้น  อาหารผสมที่ใช้ส่วนใหญ่ประกอบด้วยวัตถุดิบอาหารสัตว์ชนิดต่าง ๆ ซึ่งส่วนใหญ่เป็นผลพลอยได้จากการบริโภคของคน เช่น ปลายข้าว รำละเอียด และกากถั่วเหลือง เป็นต้น นำมาประกอบกันในอัตราส่วนที่แตกต่างกันแล้วแต่ขนาดและอายุของหมูเพื่อให้ได้คุณค่าอาหารครบถ้วนทั้ง ๕ หมู่ ดังนี้
                </Text>
                    <View style={styles.center}>
                        <Image style={{ width: 250, height: 150 }}
                            source={knowledge02} />
                        <Text style={[styles.kanit, styles.textimage]}>
                            รำข้าว ส่วนหนึ่งของวัตถุดิบที่ใช้ในการผสมอาหารของสุกร
                    </Text>
                    </View>
                    <Text style={[styles.titletext2, styles.kanit]}>
                        1. น้ำ
                </Text>
                    <Text style={[styles.text, styles.kanit]}>
                        เป็นสิ่งจำเป็นต่อคนและสัตว์ทุกชนิด น้ำเป็นตัวช่วยปรับอุณหภูมิภายในร่างกายให้คงที่ช่วยขับถ่ายของเสียออกนอกร่างกายและช่วยในขบวนการต่าง ๆ ที่เกิดขึ้นภายในร่างกายหมูต้องการน้ำอย่างมากเพราะหมูมีชั้นไขมันอยู่ติดกับผิวหนังทำให้ยากต่อการระบายความร้อนจึงต้องใช้น้ำเป็นตัวช่วยระบายความร้อน ถ้าหากหมูขาดน้ำเพียงครึ่งวันจะมีอาการหอบและถ้าขาดน้ำเป็นเวลานาน หมูอาจช็อกตายได้
                </Text>
                    <Text style={[styles.titletext2, styles.kanit]}>
                        2. คาร์โบไฮเดรต
                </Text>
                    <Text style={[styles.text, styles.kanit]}>
                        เป็นแหล่งให้พลังงานและจะนำไปใช้ในกระบวนการต่าง ๆ เพื่อการเจริญเติบโตของหมู อาหารประเภทนี้ส่วนใหญ่ คือ แป้งและน้ำตาล ผลิตผลที่นิยมใช้เป็นอาหารสัตว์ ได้แก่ ปลายข้าว ข้าวโพด ข้าวฟ่าง และมันสำปะหลัง เป็นต้น วัตถุดิบเหล่านี้มีราคาถูกเพราะมีระดับโปรตีนต่ำแต่ใช้ในสูตรอาหารในปริมาณมาก
                </Text>
                    <Text style={[styles.titletext2, styles.kanit]}>
                        3. โปรตีน
                </Text>
                    <Text style={[styles.text, styles.kanit]}>
                        เป็นสารอาหารที่มีความสำคัญมากเพราะร่างกายต้องการโปรตีนเพื่อใช้ในการเจริญเติบโตและการสร้างเนื้อเยื่อต่าง ๆ เป็นต้น ถ้าสัตว์ขาดสารอาหารนี้แล้วจะทำให้สัตว์แคระแกร็น โตช้า และสุขภาพอ่อนแอ วัตถุดิบประเภทนี้ ได้แก่ กากถั่วเหลือง กากถั่วลิสง กากงา ปลาป่น ฯลฯ เป็นต้น โดยทั่วไปมีราคาแพงและคุณภาพไม่แน่นอน
                </Text>
                    <Text style={[styles.titletext2, styles.kanit]}>
                        4. ไขมัน
                </Text>
                    <Text style={[styles.text, styles.kanit]}>
                        เป็นแหล่งให้พลังงานและให้กรดไขมันชนิดต่าง ๆ ซึ่งปกติในวัตถุดิบอาหารสัตว์ส่วนใหญ่มีไขมันเป็นส่วนประกอบในปริมาณที่แตกต่างกันอยู่แล้ว แต่ถ้าอาหารผสมนั้นขาดพลังงานแล้วจะเสริมด้วยแหล่งไขมันซึ่งมีทั้งไขมันจากพืช เช่น น้ำมันถั่วเหลือง น้ำมันรำ หรือไขมันจากสัตว์ เช่น ไขวัว น้ำมันหมู เป็นต้น
                </Text>
                    <Text style={[styles.titletext2, styles.kanit]}>
                        5. วิตามินและแร่ธาตุ
                </Text>
                    <Text style={[styles.text, styles.kanit]}>
                        ร่างกายหมูมีความต้องการวิตามินและแร่ธาตุในปริมาณน้อยแต่มีความจำเป็นต่อร่างกายมากเพราะกระบวนการต่าง ๆ ภายในร่างกายจำเป็นต้องใช้ทั้งวิตามินและแร่ธาตุต่าง ๆ ร่วมด้วย วิตามินที่มีความจำเป็นต่อหมูแบ่งออกเป็น ๒ ชนิด คือ
                    {"\n"}{'\u00A0'}  5.1 วิตามินที่ละลายในไขมัน เช่น วิตามินเอ ดี อี และเค
                    {"\n"}{'\u00A0'}  5.2 วิตามินที่ละลายในน้ำ ได้แก่ วิตามินบีต่าง ๆ
                    ส่วนแร่ธาตุที่มีความจำเป็นต่อร่างกาย ได้แก่ แคลเซียม ฟอสฟอรัส โพแทสเซียม โซเดียม แมกนีเซียม เหล็ก ทองแดง และสังกะสี เป็นต้น
                </Text>
                </ScrollView>
            </Container>
        );
    }
}

const styles = StyleSheet.create({
    box: {
        justifyContent: 'center',
        alignItems: 'center',
    },
    center: {
        flex: 1,
        flexDirection: 'column',
        alignItems: 'center',
    },
    kanit: {
        fontFamily: 'Kanit-Regular'
    },
    titletext: {
        fontSize: 20,
        paddingLeft: 20,
        paddingTop: 10,
        paddingBottom: 5
    },
    titletext2: {
        fontSize: 16,
        color: '#1A237E',
        paddingLeft: 20,
        paddingTop: 20
    },
    text: {
        fontSize: 14,
        paddingLeft: 20,
        paddingRight: 30,
        paddingTop: 10,
        paddingBottom: 10
    },
    textimage: {
        fontSize: 11,
        alignItems: 'center'
    }
});
export default Info;
